#подключаем бибилотеку математики
import math
#пишем команду,чтобы человек сам ввел значение радиуса
rad = float(input("введите радиус круга в сантиметрах:"))
#записываем число пи,чтобы было удобней считать
P=3.14
#вычисляем наши значения
print("длина окружности в сантиметрах:", 2 * P * rad)
print("площадь круга в сантиметрах:", P * rad**2)
#переводим радиус в метры
z = rad/100
#вычесляем значения в метрах
print("длина окружности в метрах:", 2 * P * z)
print("площадь круга в метрах:", P*z**2)
#вычисляем значения в сантиметрах и метрах для вписанных в окружность фигур
print("сторона вписанного в окружность квадрата в (см):", 2**0.5*rad,"сторона вписанного в окружность равностороннего треугольника в (см):",3**0.5*rad)
print("сторона вписанного в окружность квадрата в (м):", 2**0.5*z,"сторона вписанного в окружность равностороннего треугольника в (м):",3**0.5*z)
#вычисляем значения в сантиметрах и метрах для описанных фигур
print("сторона описанного около окружности квадрата в (см):",2*rad,"сторона описанного около окружности равностороннего треугольника в (см):", 2*rad*3**0.5,"сторона правильного восьмиугольника в (см):", 2*rad*(2**0.5-1))
print("сторона описанного около окружности квадрата в (м):",2*z,"сторона описанного около окружности равностороннего треугольника в (м):", 2*z*3**0.5,"сторона правильного восьмиугольника в (м):", 2*z*(2**0.5-1))